
#### Terraform Format and Style 🖌: success
#### Terraform Initialization ⚙️: success
#### Terraform Validation 🤖: Success! The configuration is valid.


#### Terraform Plan 📖: success
<details><summary>Show Plan</summary>

```
terraform
module.git.github_repository.devops_challenge: Refreshing state... [id=devops-challenge-teamsoft]
module.git.github_branch_protection.devops_challenge: Refreshing state... [id=BPR_kwDONzXdBs4DiCuz]
module.git.github_actions_secret.devops_challenge_git_auth_token: Refreshing state... [id=devops-challenge-teamsoft:GIT_AUTH_TOKEN]
module.git.github_actions_secret.devops_challenge_thandi_cidr_ipv4: Refreshing state... [id=devops-challenge-teamsoft:THANDI_CIDR_IPV4]
module.git.github_actions_secret.devops_challenge_aws_access_key_id: Refreshing state... [id=devops-challenge-teamsoft:AWS_ACCESS_KEY_ID]
module.git.github_actions_secret.devops_challenge_aws_secret_access_key: Refreshing state... [id=devops-challenge-teamsoft:AWS_SECRET_ACCESS_KEY]
module.git.github_actions_secret.devops_challenge_runner_github_token: Refreshing state... [id=devops-challenge-teamsoft:RUNNER_GITHUB_TOKEN]
module.s3.aws_s3_bucket.server_ssh_keys_bucket: Refreshing state... [id=devops-challenge-teamsoft-ssh-keys-bucket]
module.s3.aws_s3_bucket.server_terraform_bucket: Refreshing state... [id=devops-challenge-teamsoft-terraform-bucket]
module.s3.aws_s3_bucket_versioning.server_terraform_bucket: Refreshing state... [id=devops-challenge-teamsoft-terraform-bucket]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.git.github_repository.devops_challenge has changed
  ~ resource "github_repository" "devops_challenge" {
      ~ etag                        = "W/\"814dae17df22ff9dac0b29a3fd81da1b3f3e885c393ed00463f50a245a87633c\"" -> "W/\"aed1df5635671991a698d481fb0dbdd320c3e1a50fe78d8f83f15db95909f47b\""
        id                          = "devops-challenge-teamsoft"
        name                        = "devops-challenge-teamsoft"
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ec2.aws_instance.server will be created
  + resource "aws_instance" "server" {
      + ami                                  = "ami-0e1bed4f06a3b463d"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "server-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Managedby" = "Terraform"
          + "Name"      = "server"
          + "Owner"     = "Thandi"
          + "Project"   = "Server"
        }
      + tags_all                             = {
          + "Managedby" = "Terraform"
          + "Name"      = "server"
          + "Owner"     = "Thandi"
          + "Project"   = "Server"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "ccf337d8d9573956ff8d3f1c22c48b79215e4873"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + cpu_options {
          + amd_sev_snp      = (known after apply)
          + core_count       = (known after apply)
          + threads_per_core = (known after apply)
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + instance_market_options {
          + market_type = (known after apply)

          + spot_options {
              + instance_interruption_behavior = (known after apply)
              + max_price                      = (known after apply)
              + spot_instance_type             = (known after apply)
              + valid_until                    = (known after apply)
            }
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # module.ec2.aws_key_pair.main will be created
  + resource "aws_key_pair" "main" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "server-key"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = (known after apply)
      + tags            = {
          + "Managedby" = "Terraform"
          + "Name"      = "server-key"
          + "Owner"     = "Thandi"
          + "Project"   = "Server"
        }
      + tags_all        = {
          + "Managedby" = "Terraform"
          + "Name"      = "server-key"
          + "Owner"     = "Thandi"
          + "Project"   = "Server"
        }
    }

  # module.ec2.aws_s3_object.ssh_private_key will be created
  + resource "aws_s3_object" "ssh_private_key" {
      + acl                    = "private"
      + arn                    = (known after apply)
      + bucket                 = "devops-challenge-teamsoft-ssh-keys-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content                = (sensitive)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "ssh-keys/server-key.pem"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.ec2.tls_private_key.main will be created
  + resource "tls_private_key" "main" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 4096
    }

  # module.vpc.aws_internet_gateway.main will be created
  + resource "aws_internet_gateway" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Managedby" = "Terraform"
          + "Name"      = "main-internet-gateway"
          + "Owner"     = "Thandi"
          + "Project"   = "Server"
        }
      + tags_all = {
          + "Managedby" = "Terraform"
          + "Name"      = "main-internet-gateway"
          + "Owner"     = "Thandi"
          + "Project"   = "Server"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_route.main_public_internet_access will be created
  + resource "aws_route" "main_public_internet_access" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.vpc.aws_route_table.main_public will be created
  + resource "aws_route_table" "main_public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Managedby" = "Terraform"
          + "Name"      = "main-public-route-table"
          + "Owner"     = "Thandi"
          + "Project"   = "Server"
        }
      + tags_all         = {
          + "Managedby" = "Terraform"
          + "Name"      = "main-public-route-table"
          + "Owner"     = "Thandi"
          + "Project"   = "Server"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.main_public will be created
  + resource "aws_route_table_association" "main_public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_security_group.main will be created
  + resource "aws_security_group" "main" {
      + arn                    = (known after apply)
      + description            = "Setup main inbound and outbound rules"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "main-security-group"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Managedby" = "Terraform"
          + "Name"      = "main-security-group"
          + "Owner"     = "Thandi"
          + "Project"   = "Server"
        }
      + tags_all               = {
          + "Managedby" = "Terraform"
          + "Name"      = "main-security-group"
          + "Owner"     = "Thandi"
          + "Project"   = "Server"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_subnet.main_public will be created
  + resource "aws_subnet" "main_public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = (sensitive)
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Managedby" = "Terraform"
          + "Name"      = "main-public-subnet-a"
          + "Owner"     = "Thandi"
          + "Project"   = "Server"
        }
      + tags_all                                       = {
          + "Managedby" = "Terraform"
          + "Name"      = "main-public-subnet-a"
          + "Owner"     = "Thandi"
          + "Project"   = "Server"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = (sensitive)
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Managedby" = "Terraform"
          + "Name"      = "main-vpc"
          + "Owner"     = "Thandi"
          + "Project"   = "Server"
        }
      + tags_all                             = {
          + "Managedby" = "Terraform"
          + "Name"      = "main-vpc"
          + "Owner"     = "Thandi"
          + "Project"   = "Server"
        }
    }

  # module.vpc.aws_vpc_security_group_egress_rule.main_allow_all_traffic_egress_rule will be created
  + resource "aws_vpc_security_group_egress_rule" "main_allow_all_traffic_egress_rule" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Managedby" = "Terraform"
          + "Name"      = "main-allow-all-traffic-rule"
          + "Owner"     = "Thandi"
          + "Project"   = "Server"
        }
      + tags_all               = {
          + "Managedby" = "Terraform"
          + "Name"      = "main-allow-all-traffic-rule"
          + "Owner"     = "Thandi"
          + "Project"   = "Server"
        }
    }

  # module.vpc.aws_vpc_security_group_ingress_rule.main_http_ingress_rule will be created
  + resource "aws_vpc_security_group_ingress_rule" "main_http_ingress_rule" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + from_port              = 80
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Managedby" = "Terraform"
          + "Name"      = "main-http-rule"
          + "Owner"     = "Thandi"
          + "Project"   = "Server"
        }
      + tags_all               = {
          + "Managedby" = "Terraform"
          + "Name"      = "main-http-rule"
          + "Owner"     = "Thandi"
          + "Project"   = "Server"
        }
      + to_port                = 80
    }

  # module.vpc.aws_vpc_security_group_ingress_rule.main_thandi_node_exporter_ingress_rule will be created
  + resource "aws_vpc_security_group_ingress_rule" "main_thandi_node_exporter_ingress_rule" {
      + arn                    = (known after apply)
      + cidr_ipv4              = (sensitive)
      + from_port              = 9100
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Managedby" = "Terraform"
          + "Name"      = "main-thandi-ssh-rule"
          + "Owner"     = "Thandi"
          + "Project"   = "Server"
        }
      + tags_all               = {
          + "Managedby" = "Terraform"
          + "Name"      = "main-thandi-ssh-rule"
          + "Owner"     = "Thandi"
          + "Project"   = "Server"
        }
      + to_port                = 9100
    }

  # module.vpc.aws_vpc_security_group_ingress_rule.main_thandi_prometheus_ingress_rule will be created
  + resource "aws_vpc_security_group_ingress_rule" "main_thandi_prometheus_ingress_rule" {
      + arn                    = (known after apply)
      + cidr_ipv4              = (sensitive)
      + from_port              = 9090
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Managedby" = "Terraform"
          + "Name"      = "main-thandi-ssh-rule"
          + "Owner"     = "Thandi"
          + "Project"   = "Server"
        }
      + tags_all               = {
          + "Managedby" = "Terraform"
          + "Name"      = "main-thandi-ssh-rule"
          + "Owner"     = "Thandi"
          + "Project"   = "Server"
        }
      + to_port                = 9090
    }

  # module.vpc.aws_vpc_security_group_ingress_rule.main_thandi_ssh_ingress_rule will be created
  + resource "aws_vpc_security_group_ingress_rule" "main_thandi_ssh_ingress_rule" {
      + arn                    = (known after apply)
      + cidr_ipv4              = (sensitive)
      + from_port              = 22
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Managedby" = "Terraform"
          + "Name"      = "main-thandi-ssh-rule"
          + "Owner"     = "Thandi"
          + "Project"   = "Server"
        }
      + tags_all               = {
          + "Managedby" = "Terraform"
          + "Name"      = "main-thandi-ssh-rule"
          + "Owner"     = "Thandi"
          + "Project"   = "Server"
        }
      + to_port                = 22
    }

Plan: 16 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + public_instance_ip = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pusher: @thandioque, Action: pull_request, Working Directory: terraform, Workflow: Terraform Plan*